In [7]:
import numpy as np
import pandas as pd

In [155]:
s = pd.Series([12,-4,7,9])

In [156]:
s

0    12
1    -4
2     7
3     9
dtype: int64

In [157]:
s = pd.Series([12,-4,7,9], index=['a','b','c','d'])

In [158]:
s

a    12
b    -4
c     7
d     9
dtype: int64

In [159]:
s.values

array([12, -4,  7,  9], dtype=int64)

In [160]:
s.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [161]:
s['b']

-4

In [162]:
s[0:3]

a    12
b    -4
c     7
dtype: int64

In [163]:
s[['b','d']]

b   -4
d    9
dtype: int64

In [164]:
arr=np.array([1,2,3,4])

In [165]:
s = pd.Series(arr)

In [166]:
s

0    1
1    2
2    3
3    4
dtype: int32

In [167]:
s2=pd.Series(s)

In [168]:
s2

0    1
1    2
2    3
3    4
dtype: int32

In [169]:
arr[2]=0

In [170]:
arr

array([1, 2, 0, 4])

In [171]:
s2

0    1
1    2
2    0
3    4
dtype: int32

In [172]:
s/2

0    0.5
1    1.0
2    0.0
3    2.0
dtype: float64

In [173]:
s*2

0    2
1    4
2    0
3    8
dtype: int32

In [174]:
np.log(s)

C:\Users\hassan\anaconda3\lib\site-packages\pandas\core\arraylike.py:358: RuntimeWarning: divide by zero encountered in log
  result = getattr(ufunc, method)(*inputs, **kwargs)

0    0.000000
1    0.693147
2        -inf
3    1.386294
dtype: float64

In [175]:
serd = pd.Series([1,0,2,1,2,3], index=['white','white','blue','green',
                                       'green','yellow'])

In [176]:
serd

white     1
white     0
blue      2
green     1
green     2
yellow    3
dtype: int64

In [177]:
serd.unique()

array([1, 0, 2, 3], dtype=int64)

In [178]:
serd.value_counts()

1    2
2    2
0    1
3    1
dtype: int64

In [179]:
serd.value_counts()

1    2
2    2
0    1
3    1
dtype: int64

In [180]:
serd.isin([0,3])

white     False
white      True
blue      False
green     False
green     False
yellow     True
dtype: bool

In [181]:
s2 = pd.Series([5,-3,np.NaN,14])

In [182]:
s2

0     5.0
1    -3.0
2     NaN
3    14.0
dtype: float64

In [183]:
s2.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [184]:
s2.notnull()

0     True
1     True
2    False
3     True
dtype: bool

In [185]:
s2[s2.notnull()]

0     5.0
1    -3.0
3    14.0
dtype: float64

In [186]:
s2[s2.isnull()]
2 NaN

SyntaxError: invalid syntax (<ipython-input-186-847cf6deedb8>, line 2)

In [ ]:
mydict = {'red': 2000, 'blue': 1000, 'yellow': 500,
'orange': 1000}

In [ ]:
mydict

In [ ]:
mydict['red']

In [ ]:
mydict['red']

In [ ]:
myseries = pd.Series(mydict)

In [ ]:
myseries

In [ ]:
colors = ['yellow','red','orange','blue','green']

In [ ]:
myseries = pd.Series(mydict, index = colors)

In [ ]:
myseries

In [ ]:
mydict2 = {'red':400,'yellow':1000,'black':700}

In [ ]:
myseries2 = pd.Series(mydict2)
>>> myseries + myseries2

In [ ]:
data = {'color' : ['blue','green','yellow','red','white'],
'object' : ['ball','pen','pencil','paper','mug'],
'price' : [1.2,1.0,0.6,0.9,1.7],'tag': ['a','b','c','d','e']}

In [194]:
frame = pd.DataFrame(data)

In [195]:
frame

    color  object  price
0    blue    ball    1.2
1   green     pen    1.0
2  yellow  pencil    0.6
3     red   paper    0.9
4   white     mug    1.7

In [196]:
frame2 = pd.DataFrame (data,columns=['object','price'])

In [197]:
frame2

   object  price
0    ball    1.2
1     pen    1.0
2  pencil    0.6
3   paper    0.9
4     mug    1.7

In [198]:
frame3 =pd.DataFrame (data, columns=['object'])

In [199]:
frame3

   object
0    ball
1     pen
2  pencil
3   paper
4     mug

In [200]:
frame2['mug']=9

In [201]:
frame2

   object  price  mug
0    ball    1.2    9
1     pen    1.0    9
2  pencil    0.6    9
3   paper    0.9    9
4     mug    1.7    9

In [202]:
frame.loc[4,'price']=3.3

In [203]:
frame

    color  object  price
0    blue    ball    1.2
1   green     pen    1.0
2  yellow  pencil    0.6
3     red   paper    0.9
4   white     mug    3.3

In [204]:
frame.loc[0:1]

   color object  price
0   blue   ball    1.2
1  green    pen    1.0

In [205]:
frame.loc[1:3:]

    color  object  price
1   green     pen    1.0
2  yellow  pencil    0.6
3     red   paper    0.9

In [206]:
data = {'color' : ['blue','green','yellow','red','white'],
'object' : ['ball','pen','pencil','paper','mug'],
'price' : [1.2,1.0,0.6,0.9,1.7]}

In [207]:
frame = pd.DataFrame(data)

In [208]:
frame

    color  object  price
0    blue    ball    1.2
1   green     pen    1.0
2  yellow  pencil    0.6
3     red   paper    0.9
4   white     mug    1.7

In [209]:
frame2 = pd.DataFrame(data, columns=['object','price'])

In [210]:
frame3 = pd.DataFrame(data,columns = ['color'])

In [211]:
frame3

    color
0    blue
1   green
2  yellow
3     red
4   white

In [212]:
#adding your own index lables
frame2 = pd.DataFrame(data, index=['one','two','three','four','five'])

In [213]:
frame2

        color  object  price
one      blue    ball    1.2
two     green     pen    1.0
three  yellow  pencil    0.6
four      red   paper    0.9
five    white     mug    1.7

In [214]:
#selecting list of index
#If you want to know the name of all the columns of a dataframe, you can is specify the
#columns attribute on the instance of the dataframe object
frame.columns

Index(['color', 'object', 'price'], dtype='object')

In [215]:
frame.index

RangeIndex(start=0, stop=5, step=1)

In [216]:
frame3 = pd.DataFrame(np.arange(16).reshape((4,4)),
    index=['red','blue','yellow','white'],
    columns=['ball','pen','pencil','paper'])

In [217]:
frame3

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [218]:
#You can also get the entire set of data contained within the data structure using the
#values attribute.

In [219]:
frame3.index

Index(['red', 'blue', 'yellow', 'white'], dtype='object')

In [220]:
frame3.values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [221]:
frame3['ball']

red        0
blue       4
yellow     8
white     12
Name: ball, dtype: int32

In [222]:
frame.price

0    1.2
1    1.0
2    0.6
3    0.9
4    1.7
Name: price, dtype: float64

In [223]:
frame.loc[2:]

    color  object  price
2  yellow  pencil    0.6
3     red   paper    0.9
4   white     mug    1.7

In [224]:
frame.loc[2]

color     yellow
object    pencil
price        0.6
Name: 2, dtype: object

In [225]:
frame.loc[1:2]

    color  object  price
1   green     pen    1.0
2  yellow  pencil    0.6

In [226]:
frame.loc[3:]

   color object  price
3    red  paper    0.9
4  white    mug    1.7

In [227]:
#single value within a dataframe,

In [228]:
frame['object'][3]

'paper'

In [229]:
frame['price'][4]

1.7

In [230]:
#Assigning Values
frame.index.name = 'id'
frame.columns.name = 'item'
frame

item   color  object  price
id
0       blue    ball    1.2
1      green     pen    1.0
2     yellow  pencil    0.6
3        red   paper    0.9
4      white     mug    1.7

In [231]:
frame['new'] = 12

In [232]:
frame

item   color  object  price  new
id
0       blue    ball    1.2   12
1      green     pen    1.0   12
2     yellow  pencil    0.6   12
3        red   paper    0.9   12
4      white     mug    1.7   12

In [233]:
frame['new'] = [3.0,1.3,2.2,0.8,1.1]

In [234]:
frame

item   color  object  price  new
id
0       blue    ball    1.2  3.0
1      green     pen    1.0  1.3
2     yellow  pencil    0.6  2.2
3        red   paper    0.9  0.8
4      white     mug    1.7  1.1

In [235]:
ser = pd.Series(np.arange(5))

In [236]:
ser

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [237]:
frame['new'] = ser

In [238]:
frame

item   color  object  price  new
id
0       blue    ball    1.2    0
1      green     pen    1.0    1
2     yellow  pencil    0.6    2
3        red   paper    0.9    3
4      white     mug    1.7    4

In [239]:
frame.loc[2,'price'] = 3.3

In [240]:
frame

item   color  object  price  new
id
0       blue    ball    1.2    0
1      green     pen    1.0    1
2     yellow  pencil    3.3    2
3        red   paper    0.9    3
4      white     mug    1.7    4

In [241]:
#Membership of a Value
frame.isin([1.0,'pen'])

item  color  object  price    new
id
0     False   False  False  False
1     False    True   True   True
2     False   False  False  False
3     False   False  False  False
4     False   False  False  False

In [242]:
frame[frame.isin([1.0,'pen'])]

item color object  price  new
id
0      NaN    NaN    NaN  NaN
1      NaN    pen    1.0  1.0
2      NaN    NaN    NaN  NaN
3      NaN    NaN    NaN  NaN
4      NaN    NaN    NaN  NaN

In [243]:
del frame['price']

In [244]:
frame

item   color  object  new
id
0       blue    ball    0
1      green     pen    1
2     yellow  pencil    2
3        red   paper    3
4      white     mug    4

In [245]:
#Filtering
frame[frame < 1]

TypeError: '<' not supported between instances of 'str' and 'int'

In [246]:
frame.loc[[2,4]]

item   color  object  new
id
2     yellow  pencil    2
4      white     mug    4

In [247]:
#DataFrame from Nested dict
nestdict = { 'red': { 2012: 22, 2013: 33 },
'white': { 2011: 13, 2012: 22, 2013: 16},
'blue': {2011: 17, 2012: 27, 2013: 18}}

In [248]:
frame2 = pd.DataFrame(nestdict)

In [249]:
frame2

       red  white  blue
2012  22.0     22    27
2013  33.0     16    18
2011   NaN     13    17

In [250]:
#Transposition of a Dataframe

In [251]:
frame2.T

       2012  2013  2011
red    22.0  33.0   NaN
white  22.0  16.0  13.0
blue   27.0  18.0  17.0

In [252]:
#The Index Objects
ser = pd.Series([5,0,3,8,4], index=['red','blue','yellow','white','green'])
ser.index

Index(['red', 'blue', 'yellow', 'white', 'green'], dtype='object')

In [253]:
#Methods on Index
ser.idxmin()
'blue'
ser.idxmax()
'white'

'white'

In [254]:
#Index with Duplicate Labels
serd = pd.Series(range(6), index=['white','white','blue','green',
'green','yellow'])

In [255]:
serd

white     0
white     1
blue      2
green     3
green     4
yellow    5
dtype: int64

In [256]:
#Index with Duplicate Labels

In [257]:
serd = pd.Series(range(6), index=['white','white','blue','green',
'green','yellow'])
serd

white     0
white     1
blue      2
green     3
green     4
yellow    5
dtype: int64

In [258]:
serd['white']

white    0
white    1
dtype: int64

In [259]:
serd.index.is_unique

False

In [260]:
frame.index.is_unique

True

In [261]:
ser = pd.Series([2,5,7,4], index=['one','two','three','four'])
>>> ser

one      2
two      5
three    7
four     4
dtype: int64

In [262]:
ser.reindex(['three','four','five','one','two'])

three    7.0
four     4.0
five     NaN
one      2.0
two      5.0
dtype: float64

In [263]:
ser3 = pd.Series([1,5,6,3],index=[0,3,5,6])
>>> ser3

0    1
3    5
5    6
6    3
dtype: int64

In [264]:
ser3.reindex(range(6),method='ffill')

0    1
1    1
2    1
3    5
4    5
5    6
dtype: int64

In [265]:
frame.reindex(range(5), method='ffill',columns=['colors','price','new',
'object'])

ValueError: index must be monotonic increasing or decreasing

In [266]:
ser = pd.Series(np.arange(4.), index=['red','blue','yellow','white'])

In [267]:
ser

red       0.0
blue      1.0
yellow    2.0
white     3.0
dtype: float64

In [268]:
ser.drop('red')

blue      1.0
yellow    2.0
white     3.0
dtype: float64

In [269]:
ser.drop('white')

red       0.0
blue      1.0
yellow    2.0
dtype: float64

In [270]:
ser.drop(['blue','white'])

red       0.0
yellow    2.0
dtype: float64

In [271]:
ser.drop(['blue','white'])

red       0.0
yellow    2.0
dtype: float64

In [344]:
frame = pd.DataFrame(np.arange(16).reshape((4,4)),
... index=['red','blue','yellow','white'],
... columns=['ball','pen','pencil','paper'])

In [345]:
frame

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [346]:
frame.drop(['blue','yellow'])

       ball  pen  pencil  paper
red       0    1       2      3
white    12   13      14     15

In [347]:
frame.drop(['pen','pencil'],axis=1)#deleting of column

        ball  paper
red        0      3
blue       4      7
yellow     8     11
white     12     15

In [348]:
#Arithmetic and Data Alignment

In [349]:
s1 = pd.Series([3,2,5,1],['white','yellow','green','blue'])

In [350]:
s2 = pd.Series([1,4,7,2,1],['white','yellow','black','blue','brown'])

In [351]:
s1+s2

black     NaN
blue      3.0
brown     NaN
green     NaN
white     4.0
yellow    6.0
dtype: float64

In [352]:
frame2 = pd.DataFrame(np.arange(12).reshape((4,3)),
... index=['blue','green','white','yellow'],
... columns=['mug','pen','ball'])

In [353]:
frame2

        mug  pen  ball
blue      0    1     2
green     3    4     5
white     6    7     8
yellow    9   10    11

In [354]:
frame + frame2

        ball  mug  paper   pen  pencil
blue     6.0  NaN    NaN   6.0     NaN
green    NaN  NaN    NaN   NaN     NaN
red      NaN  NaN    NaN   NaN     NaN
white   20.0  NaN    NaN  20.0     NaN
yellow  19.0  NaN    NaN  19.0     NaN

In [355]:
#Flexible Arithmetic Methods
frame.add(frame2)

        ball  mug  paper   pen  pencil
blue     6.0  NaN    NaN   6.0     NaN
green    NaN  NaN    NaN   NaN     NaN
red      NaN  NaN    NaN   NaN     NaN
white   20.0  NaN    NaN  20.0     NaN
yellow  19.0  NaN    NaN  19.0     NaN

In [356]:
frame.sub(frame2)

        ball  mug  paper  pen  pencil
blue     2.0  NaN    NaN  4.0     NaN
green    NaN  NaN    NaN  NaN     NaN
red      NaN  NaN    NaN  NaN     NaN
white    4.0  NaN    NaN  6.0     NaN
yellow  -3.0  NaN    NaN -1.0     NaN

In [357]:
#Operations Between DataFrame and Series

In [358]:
frame = pd.DataFrame(np.arange(16).reshape((4,4)),
... index=['red','blue','yellow','white'],
... columns=['ball','pen','pencil','paper'])

In [359]:
frame

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [360]:
ser = pd.Series(np.arange(4), index=['ball','pen','pencil','paper'])
ser

ball      0
pen       1
pencil    2
paper     3
dtype: int32

In [361]:
frame-ser

        ball  pen  pencil  paper
red        0    0       0      0
blue       4    4       4      4
yellow     8    8       8      8
white     12   12      12     12

In [362]:
ser['mug']=9

In [363]:
ser

ball      0
pen       1
pencil    2
paper     3
mug       9
dtype: int64

In [364]:
frame-ser

        ball  mug  paper  pen  pencil
red        0  NaN      0    0       0
blue       4  NaN      4    4       4
yellow     8  NaN      8    8       8
white     12  NaN     12   12      12

In [365]:
#Function Application and Mapping
np.sqrt(frame)

            ball       pen    pencil     paper
red     0.000000  1.000000  1.414214  1.732051
blue    2.000000  2.236068  2.449490  2.645751
yellow  2.828427  3.000000  3.162278  3.316625
white   3.464102  3.605551  3.741657  3.872983

In [366]:
f = lambda x: x.max() - x.min()
frame.apply(f)

ball      12
pen       12
pencil    12
paper     12
dtype: int64

In [367]:
frame.apply(f, axis=1)

red       3
blue      3
yellow    3
white     3
dtype: int64

In [368]:
#Statistics Functions

In [369]:
frame.sum()

ball      24
pen       28
pencil    32
paper     36
dtype: int64

In [370]:
frame.mean()

ball      6.0
pen       7.0
pencil    8.0
paper     9.0
dtype: float64

In [371]:
frame.describe()

            ball        pen     pencil      paper
count   4.000000   4.000000   4.000000   4.000000
mean    6.000000   7.000000   8.000000   9.000000
std     5.163978   5.163978   5.163978   5.163978
min     0.000000   1.000000   2.000000   3.000000
25%     3.000000   4.000000   5.000000   6.000000
50%     6.000000   7.000000   8.000000   9.000000
75%     9.000000  10.000000  11.000000  12.000000
max    12.000000  13.000000  14.000000  15.000000

In [372]:
frame.sort_index()

        ball  pen  pencil  paper
blue       4    5       6      7
red        0    1       2      3
white     12   13      14     15
yellow     8    9      10     11

In [373]:
frame.sort_index(axis=1)

        ball  paper  pen  pencil
red        0      3    1       2
blue       4      7    5       6
yellow     8     11    9      10
white     12     15   13      14

In [374]:
ser.sort_values()

ball      0
pen       1
pencil    2
paper     3
mug       9
dtype: int64

In [375]:
frame.sort_values(by='pen')

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [376]:
frame.sort_values(by= 'paper')

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [377]:
frame.sort_values(by=['pen','pencil'])

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [378]:
ser.rank()

ball      1.0
pen       2.0
pencil    3.0
paper     4.0
mug       5.0
dtype: float64

In [379]:
ser.rank(method='first')

ball      1.0
pen       2.0
pencil    3.0
paper     4.0
mug       5.0
dtype: float64

In [380]:
ser.rank(ascending=False)

ball      5.0
pen       4.0
pencil    3.0
paper     2.0
mug       1.0
dtype: float64

In [381]:
seq2 = pd.Series([3,4,3,4,5,4,3,2],['2006','2007','2008',
'2009','2010','2011','2012','2013'])
seq = pd.Series([1,2,3,4,4,3,2,1],['2006','2007','2008',
'2009','2010','2011','2012','2013'])

In [382]:
seq2.corr(seq)

0.7745966692414834

In [383]:
frame.corr()

        ball  pen  pencil  paper
ball     1.0  1.0     1.0    1.0
pen      1.0  1.0     1.0    1.0
pencil   1.0  1.0     1.0    1.0
paper    1.0  1.0     1.0    1.0

In [384]:
frame2.cov()

       mug   pen  ball
mug   15.0  15.0  15.0
pen   15.0  15.0  15.0
ball  15.0  15.0  15.0

In [385]:
ser = pd.Series([0,1,2,3,9],

SyntaxError: unexpected EOF while parsing (<ipython-input-385-95a39d90cfc7>, line 1)

In [386]:
ser = pd.Series([0,1,2,3,9],
index=['red','blue','yellow','white','green'])

In [387]:
ser

red       0
blue      1
yellow    2
white     3
green     9
dtype: int64

In [388]:
frame2.corrwith(ser)

mug    -0.107763
pen    -0.107763
ball   -0.107763
dtype: float64

In [389]:
#Assigning a NaN Value
ser = pd.Series([0,1,2,np.NaN,9],
index=['red','blue','yellow','white','green'])

In [390]:
ser

red       0.0
blue      1.0
yellow    2.0
white     NaN
green     9.0
dtype: float64

In [391]:
ser['white'] = None

In [392]:
ser

red       0.0
blue      1.0
yellow    2.0
white     NaN
green     9.0
dtype: float64

In [393]:
#Filtering Out NaN Values
ser.dropna()

red       0.0
blue      1.0
yellow    2.0
green     9.0
dtype: float64

In [394]:
ser[ser.notnull()]

red       0.0
blue      1.0
yellow    2.0
green     9.0
dtype: float64

In [395]:
ser[ser.notnull()]

red       0.0
blue      1.0
yellow    2.0
green     9.0
dtype: float64

In [396]:
frame3 = pd.DataFrame([[6,np.nan,6],[np.nan,np.nan,np.nan],[2,np.nan,5]],
index = ['blue','green','red'],
columns = ['ball','mug','pen'])

In [397]:
frame3

       ball  mug  pen
blue    6.0  NaN  6.0
green   NaN  NaN  NaN
red     2.0  NaN  5.0

In [398]:
ser[ser.notnull()]

red       0.0
blue      1.0
yellow    2.0
green     9.0
dtype: float64

In [399]:
frame3.dropna()

Empty DataFrame
Columns: [ball, mug, pen]
Index: []

In [400]:
#to avoid having entire rows and columns disappear completely, you
#should specify the how option, assigning a value of all to it.

In [401]:
frame3.dropna(how='all')

      ball  mug  pen
blue   6.0  NaN  6.0
red    2.0  NaN  5.0

In [402]:
frame3.fillna(0)

       ball  mug  pen
blue    6.0  0.0  6.0
green   0.0  0.0  0.0
red     2.0  0.0  5.0

In [403]:
frame3.fillna({'ball':1,'mug':0,'pen':99})

       ball  mug   pen
blue    6.0  0.0   6.0
green   1.0  0.0  99.0
red     2.0  0.0   5.0

frame3

In [404]:
#Hierarchical Indexing and Leveling
mser = pd.Series(np.random.rand(8),
index=[['white','white','white','blue','blue','red','red',
'red'],['up','down','right','up','down','up','down','left']])

In [405]:
mser

white  up       0.496982
       down     0.024821
       right    0.938150
blue   up       0.745129
       down     0.187318
red    up       0.413707
       down     0.408874
       left     0.755011
dtype: float64

In [406]:
mser.index

MultiIndex([('white',    'up'),
            ('white',  'down'),
            ('white', 'right'),
            ( 'blue',    'up'),
            ( 'blue',  'down'),
            (  'red',    'up'),
            (  'red',  'down'),
            (  'red',  'left')],
           )

In [410]:
Pd.MultiIndex(levels=[['blue', 'red', 'white'], ['down',
'left', 'right', 'up']],
labels=[[2, 2, 2, 0, 0, 1, 1, 1],
[3, 0, 2, 3, 0, 3, 0, 1]])

NameError: name 'Pd' is not defined

In [411]:
mser['white']

up       0.496982
down     0.024821
right    0.938150
dtype: float64

In [414]:
mser[:,'up']

white    0.496982
blue     0.745129
red      0.413707
dtype: float64

In [415]:
#Intuitively, if you want to select a specific value, you specify both indexes

In [416]:
mser['white','up']

0.4969820164337865

In [417]:
mser.unstack() #convert the series to dataframe with the second index as a column

           down      left    right        up
blue   0.187318       NaN      NaN  0.745129
red    0.408874  0.755011      NaN  0.413707
white  0.024821       NaN  0.93815  0.496982

In [418]:
frame.stack() #to convert a dataframe to series()

red     ball       0
        pen        1
        pencil     2
        paper      3
blue    ball       4
        pen        5
        pencil     6
        paper      7
yellow  ball       8
        pen        9
        pencil    10
        paper     11
white   ball      12
        pen       13
        pencil    14
        paper     15
dtype: int32

In [421]:
frame.unstack()

ball    red        0
        blue       4
        yellow     8
        white     12
pen     red        1
        blue       5
        yellow     9
        white     13
pencil  red        2
        blue       6
        yellow    10
        white     14
paper   red        3
        blue       7
        yellow    11
        white     15
dtype: int32

In [8]:
mframe = pd.DataFrame(np.random.randn(16).reshape(4,4),
... index=[['white','white','red','red'], ['up','down','up','down']],
... columns=[['pen','pen','paper','paper'],[1,2,1,2]])

In [9]:
mframe

                 pen               paper
                   1         2         1         2
white up   -0.486690  0.783212  0.744141 -0.567496
      down  0.803538 -0.013296 -1.265716  1.144016
red   up    1.334292  0.393193  0.980187 -0.420660
      down -1.509714 -1.221032 -1.371457  0.354093

In [10]:
#Reordering and Sorting Levels

In [11]:
mframe.columns.names = ['objects','id']
mframe.index.names = ['colors','status']

In [12]:
mframe

objects             pen               paper
id                    1         2         1         2
colors status
white  up     -0.486690  0.783212  0.744141 -0.567496
       down    0.803538 -0.013296 -1.265716  1.144016
red    up      1.334292  0.393193  0.980187 -0.420660
       down   -1.509714 -1.221032 -1.371457  0.354093

In [13]:
mframe.swaplevel('colors','status')

objects             pen               paper
id                    1         2         1         2
status colors
up     white  -0.486690  0.783212  0.744141 -0.567496
down   white   0.803538 -0.013296 -1.265716  1.144016
up     red     1.334292  0.393193  0.980187 -0.420660
down   red    -1.509714 -1.221032 -1.371457  0.354093

In [14]:
mframe.sort_index(level='colors')

objects             pen               paper
id                    1         2         1         2
colors status
red    down   -1.509714 -1.221032 -1.371457  0.354093
       up      1.334292  0.393193  0.980187 -0.420660
white  down    0.803538 -0.013296 -1.265716  1.144016
       up     -0.486690  0.783212  0.744141 -0.567496

In [15]:
#Summary Statistic by Level
mframe.sum(level='colors')

objects       pen               paper
id              1         2         1         2
colors
white    0.316849  0.769916 -0.521575  0.576520
red     -0.175422 -0.827839 -0.391270 -0.066566

In [16]:
mframe.sum(level='id', axis=1)

id                    1         2
colors status
white  up      0.257451  0.215716
       down   -0.462178  1.130720
red    up      2.314479 -0.027467
       down   -2.881171 -0.866939